Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: No IDE fatal errors
zh_cn: 没有 IDE 致命错误

source: No JDK specified
zh_cn: 未指定 JDK

source: No JDK specified for module ''{0}''
zh_cn: 没有为模块 ''{0}'' 指定 JDK

source: No Licenses on Server
zh_cn: 服务器上没有许可证

source: No Recent Find Usages Entries
zh_cn: 没有发现最近查找使用的条目

source: No SDK Specified
zh_cn: 未指定 SDK

source: No Source Roots Configured
zh_cn: 没有配置源根目录

source: No Source Roots configured for module {0} Please use Settings | Paths to configure roots.
zh_cn: 没有为 {0} 模块配置源根目录 请使用 设置|路径 配置根目录。

source: No Test Results
zh_cn: 无测试结果

source: No Usages Found in the Project
zh_cn: 项目中没有使用

source: No VCS plugins with Check-out action installed.
zh_cn: 没有安装检出操作的 VCS 插件。

source: No XML at the location: {0}
zh_cn: 位置上没有 XML: {0}

source: No actions
zh_cn: 无动作

source: No actions found
zh_cn: 未找到操作

source: No actions in main menu found
zh_cn: 在主菜单没找到操作

source: No analysis has been performed
zh_cn: 没有执行任何分析

source: No applet class specified
zh_cn: 没有指定 applet 类

source: No argument expected on ''{0}'' option
zh_cn: ''{0}'' 选项上不期望任何参数

source: No breakpoints
zh_cn: 没有断点

source: No changes detected
zh_cn: 没有检测到更改

source: No changes matching criteria found
zh_cn: 没有找到匹配条件的更改

source: No class in selected text editor
zh_cn: 选中的编辑器里没有类

source: No class name for exception breakpoint
zh_cn: 没有异常断点的类名

source: No class name specified
zh_cn: 未指定类名称

source: No class patterns configured
zh_cn: 没有配置类模式

source: No class references has been found.
zh_cn: 没有找到类引用。

source: No code duplicates found.
zh_cn: 未找到代码重复。

source: No conflicts
zh_cn: 没有冲突

source: No coverage
zh_cn: 没有覆盖

source: No data: {0}
zh_cn: 没有数据: {0}

source: No dependencies of {0} on {1} found.
zh_cn: 在 {1} 没有发现 {0} 的依赖。

source: No description
zh_cn: 没有描述

source: No destination class specified
zh_cn: 未指定目标类

source: No documentation found.
zh_cn: 没有找到文档。

source: No enabled actions found
zh_cn: 未找到启用的操作

source: No enclosing instance of type ''{0}'' is in scope
zh_cn: 范围内没有包含类型 ''{0}'' 的实例

source: No errors detected
zh_cn: 没有检测到的错误

source: No errors found in this file
zh_cn: 在这个文件中没有发现的错误

source: No exceptions thrown in the method found
zh_cn: 找不到方法中抛出异常

source: No exclude patterns
zh_cn: 不排除模式

source: No excludes
zh_cn: 不排除

source: No executable code found at line {0} in class {1}
zh_cn: 在类 {1} 的 {0} 行没有找到可执行代码

source: No existing implementations found
zh_cn: 找不到现有的实现

source: No extends clause allowed for enum
zh_cn: 枚举不允许扩展子句

source: No external resources
zh_cn: 没有外部资源

source: No external tools configured
zh_cn: 没有配置外部工具

source: No field name specified
zh_cn: 未指定字段名

source: No fields selected
zh_cn: 未选择任何字段

source: No fields to display
zh_cn: 没有要显示的字段

source: No file on disk will be hurt.
zh_cn: 磁盘上的文件不会受到损坏。

source: No files found
zh_cn: 找不到文件

source: No files will be deleted on disk.
zh_cn: 磁盘上不会删除任何文件。

source: No files will be deleted.
zh_cn: 没有文件将被删除。

source: No filters configured
zh_cn: 没有配置过滤器

source: No frameworks detected.
zh_cn: 没有检测到框架。

source: No ignored files
zh_cn: 没有忽略的文件

source: No ignored resources
zh_cn: 没有忽略资源

source: No implementations found
zh_cn: 找不到实现

source: No implements clause allowed for interface
zh_cn: 接口不允许使用 implements 子句

source: No initializer present for the field
zh_cn: 字段没有初始化器

source: No inspections found
zh_cn: 没有找到检查

source: No inspections performed
zh_cn: 没有执行任何检查

source: No inspections performed {0}
zh_cn: 没有执行检查 {0}

source: No instantiations found.
zh_cn: 没有发现实例。

source: No interface expected here
zh_cn: 这里期望不是接口

source: No interface name specified
zh_cn: 未指定接口名称

source: No java.lang.Object
zh_cn: 没有 java.lang.Object

source: No java.lang.Object class found.
zh_cn: 找不到 java.lang.Object 类。

source: No jdk for module ''{0}''
zh_cn: 模块 ''{0}'' 没有 jdk

source: No junit.jar
zh_cn: 没有 junit.jar

source: No junit.jar in {0}
zh_cn: 在 {0} 中没有 junit.jar

source: No log files attached
zh_cn: 没有附加日志文件

source: No loop statements labeled with label ''{0}''
zh_cn: 没有标签为 ''{0}'' 的循环语句

source: No main class specified
zh_cn: 未指定主类

source: No matches found
zh_cn: 找不到匹配项

source: No matches found in project
zh_cn: 项目中没有找到匹配项

source: No members selected
zh_cn: 没有成员被选中

source: No message
zh_cn: 无消息

source: No messages
zh_cn: 没有消息

source: No methods overriding {0, choice, 0#|1# '{1}'|2#these classes} are found
zh_cn: 没有找到 {0, choice, 0#|1# '{1}' |2#these classes} 重写方法

source: No modifiers allowed for enum constants
zh_cn: 枚举常数不允许使用修饰符

source: No module defined
zh_cn: 没有定义模块

source: No more highlights found
zh_cn: 没有发现更多的高亮

source: No name
zh_cn: 没有名字

source: No new name specified
zh_cn: 未指定新名称

source: No occurrences found
zh_cn: 未找到匹配项

source: No parameter name specified
zh_cn: 未指定参数名称

source: No parameters
zh_cn: 没有参数

source: No path variables
zh_cn: 没有路径变量

source: No patterns configured
zh_cn: 没有配置模式

source: No personal data will be collected.
zh_cn: 不会收集个人资料。

source: No plugin repositories configured
zh_cn: 没有配置插件库

source: No plugins currently installed.
zh_cn: 目前没有安装插件。

source: No problems found
zh_cn: 没有发现问题

source: No problems found so far
zh_cn: 到目前为止没有发现问题

source: No process input
zh_cn: 没有进程输入

source: No processes to attach to
zh_cn: 没有可附加的进程

source: No proxy
zh_cn: 没有代理

source: No quick lists
zh_cn: 没有快速列表

source: No recent projects to display.
zh_cn: 没有可显示的最近项目。

source: No registered file patterns
zh_cn: 没有已注册的文件模式

source: No renderers
zh_cn: 没有渲染器

source: No response from autodetected license server {0}
zh_cn: 自动检测许可服务器 {0} 没有响应

source: No response from server
zh_cn: 服务器无响应

source: No rules are violated
zh_cn: 没有规则被违反

source: No runner selected
zh_cn: 没有选择运行器

source: No scopes
zh_cn: 无范围

source: No search text entered
zh_cn: 未输入搜索文本

source: No selection.
zh_cn: 没有选择。

source: No shortcuts
zh_cn: 没有快捷键

source: No sources for class ''{2}''
zh_cn: 没有类 ''{2}'' 的源码

source: No such field {0} in {1}
zh_cn: 没有该字段 {0} 在 {1} 中

source: No such instance field: ''{0}''
zh_cn: 没有该实例字段：''{0}''

source: No such instance method: ''{0}''
zh_cn: 没有该实例方法:''{0}''

source: No such method
zh_cn: 没有这样的方法

source: No such static field: ''{0}''
zh_cn: 没有该静态字段：''{0}''

source: No such static method: ''{0}''
zh_cn: 没有该静态方法:''{0}''

source: No suggestions
zh_cn: 没有建议

source: No suggestions of type {0}
zh_cn: 没有 {0} 类型的建议

source: No suitable licenses left on the license server
zh_cn: 许可证服务器上没有合适的许可证

source: No superclass name specified
zh_cn: 未指定超类名称

source: No surround templates defined in this context
zh_cn: 在此上下文中没有定义包围模板

source: No suspicious code found.
zh_cn: 找不到可疑的代码。

source: No syntax highlighting performed
zh_cn: 没有执行任何语法高亮

source: No syntax highlighting performed for {0}
zh_cn: 没有为 {0} 执行语法高亮

source: No target class for the instance method is found: all referenced types are not in project
zh_cn: 找不到实例方法的目标类：所有引用类型都不在项目中

source: No target class for the instance method is found: all referenced types are unknown
zh_cn: 找不到实例方法的目标类：所有引用的类型都是未知的

source: No target directory specified
zh_cn: 未指定目标目录

source: No targets available in this context
zh_cn: 在上下文没有可用目标

source: No templates defined in this context
zh_cn: 在这个上下文中没有定义模板

source: No test class specified
zh_cn: 未指定测试类

source: No test subjects found
zh_cn: 没有找到测试对象

source: No tests found in the package ''{0}''
zh_cn: 包 ''{0}'' 中没有找到测试

source: No tests were found
zh_cn: 没有发现测试

source: No tests were found.
zh_cn: 没有发现测试。

source: No usages found
zh_cn: 没有找到用法

source: No usages found in {0}
zh_cn: 在 {0} 没有发现使用

source: No usages of {0} can be replaced with usages of {1}
zh_cn: 没有 {0} 的用法 可以替换为 {1} 的用法

source: No usages of {0} found
zh_cn: 没有找到 {0} 的用法

source: No validators available
zh_cn: 没有验证可用

source: No watches
zh_cn: 没有观察点

source: No wildcard expected
zh_cn: 不期望通配符

source: No wrap
zh_cn: 不换行

source: No {0} found in {1}{2}
zh_cn: 在 {1}{2} 中未找到 {0}

source: Node &descendands expression:
zh_cn: 节点子节点 表达式：(&D)

source: Node de&scendants:
zh_cn: 节点子节点:(&S)

source: Node label expression
zh_cn: 节点标签表达式

source: Non-ASCII characters
zh_cn: 非 ASCII 字符

source: Non-Nls comment pattern
zh_cn: Non-Nls 注释模式

source: Non-code usages
zh_cn: 没有代码使用

source: Non-commercial use only
zh_cn: 非商业用途

source: Non-empty finally blocks detected:
zh_cn: 检测到非空的 finally 块：

source: Non-existent web resource
zh_cn: 不存在的 web 资源

source: Non-short-circuit operation consumes the infinite stream
zh_cn: 非短路操作消耗无限流

source: Non-static factory of inner class{1} cannot be used in this context.
zh_cn: 内部类 {1} 的非静态工厂不能在此上下文中使用。

source: Non-static {0} ''{1}'' cannot be referenced from a static context
zh_cn: 非静态 {0} ''{1}'' 不能从静态上下文引用

source: Non-unique declaration name {0}
zh_cn: 非唯一的声明名称 {0}

source: None
zh_cn: 没有

source: None of the frames through and including frame may be native
zh_cn: 没有通过和包含任何帧，帧可能都不是本地的

source: None, disable all plugins above
zh_cn: 无，禁用上述所有插件

source: Not Excluded
zh_cn: 不排除

source: Not Reachable.
zh_cn: 不可到达的。

source: Not a directory.
zh_cn: 不是目录。

source: Not a loop label: ''{0}''
zh_cn: 不是循环标签：''{0}''

source: Not a statement
zh_cn: 不是语句

source: Not allowed in interface
zh_cn: 接口内不允许

source: Not annotated method overrides method annotated with @{0}
zh_cn: 未注解的方法重写用 @{0} 注解的方法

source: Not annotated parameter overrides @{0} parameter
zh_cn: 未注解的参数重写 @{0} 参数

source: Not compiling may result in incomplete or incorrect results.
zh_cn: 不编译可能导致不完整或不正确的结果。

source: Not enough storage is available to complete this operation.
zh_cn: 没有足够的存储可用来完成此操作。

source: Not enough storage is available to process this command.
zh_cn: 没有足够的存储可用于处理此命令。

source: Not found, try again to search from top
zh_cn: 找不到，再试一次从顶部搜索

source: Not in repository
zh_cn: 不在仓库

source: Not run
zh_cn: 未运行

source: Not showing null elements
zh_cn: 不显示 null 元素

source: Not specified
zh_cn: 未指定

source: Not top frame
zh_cn: 不是顶部框架

source: Note that this feature is NOT supported for *.java files.
zh_cn: 请注意 *.java 文件不支持此功能。

source: Note:
zh_cn: 笔记:

source: Note: all the changes you have made to the scheme will be lost.
zh_cn: 注意：您对方案所做的所有更改都将丢失。

source: Note: empty folders won't be saved
zh_cn: 注意:空文件夹不会保存

source: Note: the program will recognize only those source files, that are located under source directories.
zh_cn: 注意：程序将仅识别位于源目录下的那些源文件。

source: Note: the program will recognize only those source files, that are located under these directories.
zh_cn: 注意: 该程序将只识别那些位于这些目录下的源文件。

source: Note: the program will recognize only those source files, that are located under this directory.
zh_cn: 注意: 该程序将只识别那些位于此目录下的源文件。

source: Nothing Found to Display
zh_cn: 没有发现可显示的

source: Nothing found
zh_cn: 未找到

source: Nothing found to display
zh_cn: 没有发现可显示的

source: Nothing to Commit
zh_cn: 没有东西可提交

source: Nothing to reload
zh_cn: 没有内容重新加载

source: Nothing to reload.
zh_cn: 没有内容重新加载。

source: Nothing to show
zh_cn: 没有要显示的内容

source: Nothing to show ({0})
zh_cn: 没有要显示的内容 ({0})

source: Nothing to show in the Structure View
zh_cn: 结构视图中没有可显示项

source: Nothing to {0}
zh_cn: 没有东西 {0}

source: Notification actions
zh_cn: 通知操作

source: Notifications
zh_cn: 通知

source: Null check can be replaced with method call
zh_cn: null 检查可以用方法调用来替换

source: Null is used for ''Optional'' type in {0}
zh_cn: Null 用于 ''Optional'' 类型在 {0} 中

source: Null-check will always fail: {0} is never null
zh_cn: null 检查将失败： {0} 从不为 null

source: Number
zh_cn: 数字

source: Number postfixes:
zh_cn: 数字后缀:

source: Numeric issues
zh_cn: 数值问题

source: Numeric overflow in expression
zh_cn: 表达式中数字溢出

source: Numeric value expected
zh_cn: 预期数字值

source: Numeric value expected as array dimension
zh_cn: 数组维度预期是数值

source: O&pen exported file in browser
zh_cn: 在浏览器中打开导出的文件(&P)

source: O&pen exported file in editor
zh_cn: 在编辑器中打开导出文件(&P)

source: OK
zh_cn: 确定

source: OS marked the following folders as 'quarantined', probably because they were downloaded from Internet.Opening files from these folders might not work as expected.
zh_cn: 操作系统将下列文件夹标记为 '隔离' ，可能是因为它们是您从网络下载的。从这些文件夹中打开文件可能无法正常工作。

source: OS marked this folder as 'quarantined', probably because you've downloaded it from web.Opening files from this folder in external browser might not work as expected.
zh_cn: 操作系统将此文件夹标记为 '隔离' ，可能是因为它是您从 web 下载的。在外部浏览器中打开文件夹中的文件可能无法正常工作。

source: Object &id
zh_cn: 对象 id(&I)

source: Object has been collected
zh_cn: 对象已经被回收

source: Object has been garbage collected during method invocation
zh_cn: 对象在方法调用期间被垃圾回收

source: Object reference expected
zh_cn: 预期对象引用

source: Object reference expected instead of{0}
zh_cn: 预期对象引用，而不是 {0}

source: Obsolete
zh_cn: 过时的

source: Obsolete Plugins Detected
zh_cn: 检测到过时的插件

source: Occurred {1,choice,1#once|2#{1} times} since the last clear.
zh_cn: 自从上一次清除后，发生 {1,choice,1#1次|2#{1} 次} 。

source: Occurrence {0} of {1}
zh_cn: 匹配项 {0} / {1}

source: Occurrences count
zh_cn: 匹配项数量

source: Occurrences found in comments, strings and non-code files
zh_cn: 在注释，字符串和非代码文件中找到的匹配项

source: Occurrences found in comments, strings and non-code files {0}
zh_cn: 在注释，字符串和非代码文件中找到的引用 {0}

source: Occurrences found in comments, strings and non-code files {0}.
zh_cn: 在注释，字符串和非代码文件中找到的引用 {0}。

source: Occurrences found in comments, strings, non-code files and generated code
zh_cn: 在注释，字符串，非代码文件和生成的代码中找到的匹配项

source: Occurrences found in read-only files
zh_cn: 在只读文件中找到匹配项

source: Occurrences found in read-only files.
zh_cn: 在只读文件中找到匹配项。

source: Occurrences in files of total size {0} found.
zh_cn: 在文件中找到总数为 {0} 的匹配项。

source: Occurrences of ''{0}'' in {1}{2}
zh_cn: 在 {1}{2} 中 ''{0}'' 的匹配项

source: Occurrences of ''{0}''{1}
zh_cn: ''{0}''{1} 的匹配项

source: Occurrences to be migrated {0}
zh_cn: 要迁移的匹配项 {0}

source: Of those {0,choice,1#1 usage is|2#{0,number} usages are} in strings, comments, non-code files or generated code.
zh_cn: 在那些中，有 {0,number} 个使用在注释，字符串，非代码文件和生成的代码中。

source: Offline View
zh_cn: 离线查看

source: Old Changes
zh_cn: 旧变化

source: Old name
zh_cn: 旧名称

source: Old name:
zh_cn: 旧名称:

source: Old project files were saved to {0}
zh_cn: 旧项目文件已保存到 {0}

source: Older
zh_cn: 更久的

source: On Closing Tool Window with Running Process
zh_cn: 关闭正在运行进程的工具窗口

source: On Mac use Alt instead of Ctrl.
zh_cn: 在 Mac 上，使用 Alt 代替 Ctrl 。

source: On every exit
zh_cn: 在每次退出时

source: On order to invoke this refactoring, select an expression to be replaced with a constant and press &shortcut:IntroduceConstant; (Refactor | Extract Constant).
zh_cn: 为了调用这个重构，选择一个用要用常量代替的表达式，按 &shortcut:IntroduceConstant; (Refactor | Extract Constant)。

source: Once {0}
zh_cn: 一次 {0}

source: Only &VCS changed text
zh_cn: 仅 VCS 改变的文本(&V)

source: Only fields, variables, method parameters or methods of valid type can be considered.
zh_cn: 只能考虑字段，变量，方法参数或有效类型的方法。

source: Only one target allowed
zh_cn: 只允许一个目标

source: Open &generated documentation in browser
zh_cn: 在浏览器打开生成的文档(&G)

source: Open .class file
zh_cn: 打开 .class 文件

source: Open Console
zh_cn: 打开控制台

source: Open Directory...
zh_cn: 打开目录...

source: Open Existing Project
zh_cn: 打开现有项目

source: Open File or Project
zh_cn: 打开文件或项目

source: Open Files
zh_cn: 打开文件

source: Open IDE scripting console
zh_cn: 打开 IDE 脚本控制台

source: Open Library Settings
zh_cn: 打开库设置

source: Open Module Settings
zh_cn: 打开模块设置

source: Open PDF file with the default keymap reference card.
zh_cn: 打开带有默认快捷键参考卡的 PDF 文件。

source: Open Project
zh_cn: 打开项目

source: Open Project Actions
zh_cn: 打开项目操作

source: Open Project Windows
zh_cn: 打开项目窗口

source: Open Repository Version
zh_cn: 打开仓库

source: Open Source Project License.
zh_cn: 开源项目许可证。

source: Open Source at Exception
zh_cn: 在异常处打开源码

source: Open _Recent
zh_cn: 打开最近(_R)

source: Open a copy of this editor in the opposite tab group
zh_cn: 在相对的选项卡组中打开此编辑器的副本

source: Open a project or a file in editor
zh_cn: 在编辑窗口中打开项目或文件

source: Open as &File
zh_cn: 作为文件打开(&F)

source: Open as &Project
zh_cn: 作为项目打开(&P)

source: Open browser
zh_cn: 打开浏览器

source: Open browser with documentation for the selected item
zh_cn: 为选中项目文件打开浏览器

source: Open code folding options
zh_cn: 打开代码折叠选项

source: Open console
zh_cn: 打开控制台

source: Open console for selected entity
zh_cn: 为所选的实体打开控制台

source: Open console with the navigatable stacktrace
zh_cn: 打开有导航堆栈跟踪的控制台

source: Open edit Run/Debug configurations dialog
zh_cn: 打开编辑运行/调试配置对话框

source: Open editor for the selected item
zh_cn: 打开选中项目的编辑器

source: Open editor for the selected item and give focus to it
zh_cn: 打开选中项目的编辑器并放置焦点

source: Open editor for the selected item in new window and give focus to it
zh_cn: 在新窗口打开选中项目的编辑器并放置焦点

source: Open editor with selected revision of the file
zh_cn: 为文件的所选修订版本打开编辑器

source: Open file or project.
zh_cn: 打开文件或项目。

source: Open generated HTML in &browser
zh_cn: 在浏览器中打开生成的 HTML(&B)

source: Open image in external editor
zh_cn: 在外部编辑器打开图像

source: Open in Find Window
zh_cn: 在查找窗口中打开

source: Open in browser
zh_cn: 在浏览器中打开

source: Open in new &tab
zh_cn: 在新标签中打开(&T)

source: Open in new ta&b
zh_cn: 在新选项卡中打开(&B)

source: Open matching files in {0}:
zh_cn: 在 {0} 打开匹配的文件:

source: Open message view
zh_cn: 打开信息视图

source: Open migration dialog
zh_cn: 打开迁移对话框

source: Open parameter name hints settings
zh_cn: 打开参数名称提示设置

source: Open project in new window
zh_cn: 在新窗口打开项目

source: Open project in the same window
zh_cn: 在同一窗口打开项目

source: Open run/debug configurations dropdown
zh_cn: 打开运行/调试配置下拉列表

source: Open selected test in editor
zh_cn: 在编辑器中打开选定的测试

source: Open settings dialog for selected module
zh_cn: 为选中模块打开设置对话框

source: Open source
zh_cn: 打开源码

source: Open source file
zh_cn: 打开源文件

source: Open source in new window
zh_cn: 在新窗口中打开源码

source: Open source of the selected item
zh_cn: 打开选中项的源码

source: Open source of the selected value's type
zh_cn: 打开选中值类型的源码

source: Open {0} file or project.
zh_cn: 打开 {0} 文件或项目。

source: Open...
zh_cn: 打开...

source: OpenJDK shows intermittent performance and UI issues.
zh_cn: OpenJDK 显示间歇性的性能和 UI 问题。

source: OpenSSH config and authentication agent
zh_cn: OpenSSH 配置和身份验证代理

source: OpenSSH or PuTTY
zh_cn: OpenSSH 或 PuTTY

source: Opening editors...
zh_cn: 打开编辑器...

source: Opening project...
zh_cn: 打开项目...

source: Opening {0}
zh_cn: 打开 {0}

source: Opens a target of this symlink in the Project View
zh_cn: 在项目视图中打开此符号链接的目标

source: Opens an editor tab with a custom VM options file
zh_cn: 打开具有自定义 VM 选项文件的编辑器选项卡

source: Opens an editor tab with a custom properties file
zh_cn: 打开带有自定义属性文件的编辑器选项卡

source: Opens folder with log file
zh_cn: 打开带日志文件的文件夹

source: Operation ''{0}'' not supported
zh_cn: 操作 ''{0}'' 不支持

source: Operation canceled
zh_cn: 操作取消

source: Operation is not supported
zh_cn: 操作不被支持

source: Operation not supported by VM
zh_cn: VM 不支持的操作

source: Operation sign on next line
zh_cn: 操作符号在下一行

source: Operator ''{0}'' cannot be applied to ''{1}''
zh_cn: 运算符 ''{0}'' 不能应用于 ''{1}''

source: Operator ''{0}'' cannot be applied to ''{1}'', ''{2}''
zh_cn: 运算符 ''{0}'' 不能应用于 ''{1}''，''{2}''

source: Optimi_ze Imports
zh_cn: 优化导入(_Z)

source: Optimize Imports
zh_cn: 优化导入

source: Optimize Imports Before Commit
zh_cn: 提交前优化导入

source: Optimize imports
zh_cn: 优化导入

source: Optimize imports on the fly (for current project)
zh_cn: 快速优化导入(对于当前项目)

source: Optimizing imports...
zh_cn: 优化导入...

source: Optional.
zh_cn: 可选的。

source: Options
zh_cn: 选项

source: Order
zh_cn: 顺序

source: Order of Members
zh_cn: 成员顺序

source: Order/Export
zh_cn: 排序/导出

source: Order:
zh_cn: 顺序:

source: Organic Layout
zh_cn: 有机布局

source: Orientation
zh_cn: 方向

source: Origin
zh_cn: 起始

source: Original class
zh_cn: 原始类

source: Original image height is {0}
zh_cn: 原始图像高度为 {0}

source: Original image width is {0}
zh_cn: 原始图像宽度为 {0}

source: Orthogonal Layout
zh_cn: 正交布局

source: Other
zh_cn: 其他

source: Other File Types
zh_cn: 其他文件类型

source: Other Languages
zh_cn: 其他语言

source: Other Settings
zh_cn: 其他设置

source: Out of Memory
zh_cn: 内存不足

source: Out of memory.
zh_cn: 内存不足。

source: Outdated version.
zh_cn: 过时的版本。

source: Output
zh_cn: 输出

source: Output &Filters...
zh_cn: 输出过滤器...(&F)

source: Output &directory:
zh_cn: 输出目录:(&D)

source: Output Directory for Artifact
zh_cn: 构件输出目录

source: Output Filters
zh_cn: 输出过滤器

source: Output directory "{0}" does not exist Do you want to create it?
zh_cn: 输出目录 "{0}" 不存在 你想创建它吗？

source: Output directory is not specified.
zh_cn: 未指定输出目录。

source: Output directory:
zh_cn: 输出目录:

source: Output file name is empty
zh_cn: 输出文件的名称为空

source: Output file name is not valid
zh_cn: 输出文件的名称无效

source: Output file name:
zh_cn: 输出文件名:

source: Output path
zh_cn: 输出路径

source: Output path is empty
zh_cn: 输出路径为空

source: Output path:
zh_cn: 输出路径：

source: Output variables
zh_cn: 输出变量

source: Outside Any Group
zh_cn: 在任何组外

source: Over&riding methods
zh_cn: 重写方法(&R)

source: Overlapping Check
zh_cn: 重叠检查

source: Overlapping fold region(s) exist
zh_cn: 存在重叠折叠区域

source: Overloaded Methods Usages
zh_cn: 重载方法使用

source: Overridden Method Warning
zh_cn: 重写方法警告

source: Overridden method parameters are not annotated
zh_cn: 重写方法的参数没有注解

source: Overridden methods are not annotated
zh_cn: 重写的方法没有注解。

source: Override Library Settings
zh_cn: 覆盖库设置

source: Override Method
zh_cn: 重写方法

source: Override Method (from Method Hierarchy)
zh_cn: 覆盖方法(从方法层次结构)

source: Override Methods
zh_cn: 重写方法

source: Override Subdirectory Template Data Languages
zh_cn: 覆盖子目录的模板数据语言

source: Override base class methods in the current class
zh_cn: 在当前类中重写基类方法

source: Override console cycle buffer size ({0} KB)
zh_cn: 覆盖控制台循环缓冲区大小 ({0} KB)

source: Override default fonts by (not recommended):
zh_cn: 覆盖默认字体(不推荐):

source: Override its value?
zh_cn: 覆盖它的值？

source: Override library settings for child directories and files?
zh_cn: 覆盖子目录和文件的库设置?

source: Override method ''{0}''
zh_cn: 重写方法 ''{0}''

source: Override them?
zh_cn: 覆盖它们？

source: Override/Implement methods
zh_cn: 重写/实现方法

source: Overrides deprecated method in ''{0}''
zh_cn: 覆盖 ''{0}'' 中的已弃用的方法

source: Overrides library methods
zh_cn: 重写库方法

source: Overrides method ''{0}'' in <a href="#javaClass/{1}">{1}</a>
zh_cn: 在 <a href="#javaClass/{1}">{1}</a> 中的覆盖方法 ''{0}''

source: Overrides method in <a href="#javaClass/{1}">{1}</a>
zh_cn: 在 <a href="#javaClass/{1}">{1}</a> 中的覆盖方法

source: Overrides method that is deprecated and marked for removal in ''{0}''
zh_cn: 覆盖了 ''{0}'' 中过时的标记为移除的方法

source: Overrides/implements
zh_cn: 重写/实现

source: Overrides:
zh_cn: 重写:

source: Overriding Methods
zh_cn: 重写方法

source: Overwrite
zh_cn: 覆盖

source: Overwrite ''{0}''?
zh_cn: 覆盖 ''{0}''?

source: Overwrite it?
zh_cn: 覆盖它？

source: Overwrite previously generated files
zh_cn: 覆盖以前生成的文件

source: Overwrite project settings with values from {0}?
zh_cn: 使用 {0} 的值覆盖项目设置？

source: Overwrite settings?
zh_cn: 覆盖设置？

source: P&ull up members of {0} to:
zh_cn: 将 {0} 的成员上拉到：(&U)

source: PSI Viewer
zh_cn: PSI 查看器

source: P_in Active Tab
zh_cn: 固定活动选项卡(_I)

source: P_in Active Tool Window Tab
zh_cn: 固定活动工具窗口选项卡(_I)

source: P_in Tab
zh_cn: 固定选项卡(_I)

source: P_revious Bookmark
zh_cn: 上一个书签(_R)

source: Pac&kage local
zh_cn: 包本地(&K)

source: Packa&ge:
zh_cn: 包:(&G)

source: Package
zh_cn: 包

source: Package ''{0}'' already has a ''package.html'' file.
zh_cn: 包 ''{0}'' 已经有一个 ''package.html'' 文件。

source: Package ''{0}'' clashes with class of same name
zh_cn: 包 ''{0}'' 与同名的类冲突

source: Package ''{0}'' does not exist
zh_cn: 包 ''{0}'' 不存在

source: Package ''{0}'' exists in another module: {1}
zh_cn: 包 ''{0}'' 存在于另一个模块: {1}

source: Package ''{0}'' is declared in module ''{1}'', but module ''{2}'' does not read it
zh_cn: 包 ''{0}'' 声明于模块 ''{1}''，但模块 ''{2}'' 未读取它

source: Package ''{0}'' is declared in module ''{1}'', which does not export it to module ''{2}''
zh_cn: 包 ''{0}'' 声明于模块 ''{1}''，没有将它导出到模块 ''{2}''

source: Package ''{0}'' is declared in module ''{1}'', which does not export it to the unnamed module
zh_cn: 包 ''{0}'' 声明于模块 ''{1}''，没有将它导出到未命名模块
